In [12]:
import pandas as pd
import numpy as np

### Merging and Joining of Dataframe

In [2]:
d1={"id":[1,2,3,4,5],"Name":["a","b","c","d","e"]}
df1=pd.DataFrame(d1)
df1

   id Name
0   1    a
1   2    b
2   3    c
3   4    d
4   5    e

In [6]:
d2={"id":[1,2,3,4,5],"Name":[11,12,15,14,17]}
df2=pd.DataFrame(d2)
df2

   id  Name
0   1    11
1   2    12
2   3    15
3   4    14
4   5    17

### pd.merge

In [4]:
#pd.merge(df1,df2,on="column name")
df3=pd.merge(df1,df2,on="id")
df3

   id Name  marks
0   1    a     11
1   2    b     12
2   3    c     15
3   4    d     14
4   5    e     17

### concatenation

In [8]:
pd.concat([df1,df2],keys=["df1","df2"])

       id Name
df1 0   1    a
    1   2    b
    2   3    c
    3   4    d
    4   5    e
df2 0   1   11
    1   2   12
    2   3   15
    3   4   14
    4   5   17

In [9]:
df=pd.read_csv("../Data/titanic.csv")

In [10]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,NaN,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [20]:
df.isna().sum()

PassengerId         0
Survived            0
Pclass              0
Name               11
Sex                 0
Age               177
SibSp               0
Parch               0
Ticket              0
Fare                0
Cabin             687
Embarked            2
label_survived      0
dtype: int64

## Apply function

In [14]:
def demo(val):
    if val==1:
        return "Alive"
    else:
        return "Dead"

In [16]:
df["label_survived"]=df["Survived"].apply(demo)
df["label_survived"]

0       Dead
1      Alive
2      Alive
3      Alive
4       Dead
       ...
886     Dead
887    Alive
888     Dead
889    Alive
890     Dead
Name: label_survived, Length: 891, dtype: object

In [19]:
def clean_price(st):
    return int(st.replace("$",""))
clean_price("$122")

122

In [21]:
df["Pclass"]=df["Pclass"].apply(np.sqrt)
df["Pclass"]

0      1.732051
1      1.000000
2      1.732051
3      1.000000
4      1.732051
         ...
886    1.414214
887    1.000000
888    1.732051
889    1.000000
890    1.732051
Name: Pclass, Length: 891, dtype: float64

### Aggregations

In [31]:
df.aggregate([np.mean,np.sum,np.median])

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,label_survived
mean,446.0,0.383838,1.488948,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN
sum,397386.0,342.000000,1326.652242,malefemalefemalefemalemalemalemalemalefemalefe...,21205.170000,466.000000,340.000000,A/5 21171PC 17599STON/O2. 31012821138033734503...,28693.949300,DeadAliveAliveAliveDeadDeadDeadDeadAliveAliveA...
median,446.0,0.000000,1.732051,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN

In [32]:
df.aggregate({"Pclass":np.mean,"label_survived":np.sum,"Age":np.median})

Pclass                                                      1.48895
label_survived    DeadAliveAliveAliveDeadDeadDeadDeadAliveAliveA...
Age                                                              28
dtype: object

In [ ]:
# accessing
#indexing -> loc,iloc
#filtering
#groupby
#missing values
#isna
#dropna
#fillna
#fillna -> forward(pad/fill) backward fill (bfill/backfill)
#replace
#merge
#concat
#apply
#aggregate

In [36]:
cabin_mode=df["Cabin"].mode()[0]
df["Cabin"]=df["Cabin"].fillna(cabin_mode)

In [37]:
df.isna().sum()

PassengerId         0
Survived            0
Pclass              0
Name               11
Sex                 0
Age               177
SibSp               0
Parch               0
Ticket              0
Fare                0
Cabin               0
Embarked            2
label_survived      0
dtype: int64

In [38]:
df["Survived"]=df["Survived"].replace({0:"dead",1:"alive"})
df["Survived"]

0       dead
1      alive
2      alive
3      alive
4       dead
       ...
886     dead
887    alive
888     dead
889    alive
890     dead
Name: Survived, Length: 891, dtype: object